In [102]:
import pandas as pd

from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [103]:
chr_rows = pd.read_csv("chr_rows.csv")

In [104]:
chr_cols = pd.read_csv("chr_cols.csv", header=None)

In [105]:
chr_rows

    Chr  Start_pos  End_pos
0  chr1       1001     2001
1  chr2       1002     2002
2  chr3       1003     2003
3  chr4       1004     2004
4  chr5       1005     2005

In [106]:
chr_cols

      0     1     2     3     4
0  chr1  chr2  chr3  chr4  chr5
1    a1    a2    a3    a4    a5
2    b1    b2    b3    b4    b5
3    c1    c2    c3    c4    c5
4    d1    d2    d3    d4    d5

In [107]:
# use pandas to take the transpose
chr_cols_t = chr_cols.transpose()

In [108]:
chr_cols_t

      0   1   2   3   4
0  chr1  a1  b1  c1  d1
1  chr2  a2  b2  c2  d2
2  chr3  a3  b3  c3  d3
3  chr4  a4  b4  c4  d4
4  chr5  a5  b5  c5  d5

In [109]:
pysqldf("SELECT chr_rows.*, chr_cols_t.* FROM chr_rows JOIN chr_cols_t ON chr_rows.Chr = chr_cols_t.[0]")

    Chr  Start_pos  End_pos     0   1   2   3   4
0  chr1       1001     2001  chr1  a1  b1  c1  d1
1  chr2       1002     2002  chr2  a2  b2  c2  d2
2  chr3       1003     2003  chr3  a3  b3  c3  d3
3  chr4       1004     2004  chr4  a4  b4  c4  d4
4  chr5       1005     2005  chr5  a5  b5  c5  d5